'use strict';

angular.module('chApp.common.directives').directive('specialistDirective', ['$compile', '$timeout', function ($compile, $timeout) {
    var template = '<select ng-model="specialties" class="form-control form-white" multiple="multiple" placeholder="{{placeholder}}"><option></option><option ng-repeat="opt in specialists">{{opt[1]}}</option></select>';
    return {
        restrict: 'A',
        replace: true,
        scope: {
            specialties: '=',
            placeholder: '@',
        },
        controller: ['$scope', '$location', '$state', function ($scope, $location, $state) {
            var wa = $scope.$watch('specialties', function (newValue, oldValue) {
                if (newValue && typeof newValue === "string") {
                    $scope.specialties = newValue.split('|');
                }

                $scope.specialists = [
                [1, '内科'], [2, '外科'], [3, '妇产科'], [4, '儿科'], [5, '神经科'], [6, '精神心理科'], [7, '中医科'], [8, '肿瘤科'], [9, '眼科'], [10, '口腔科'], 
                [11, '耳鼻咽喉科'], [12, '急诊科'], [13, '重症医学科'], [14, '麻醉科'], [15, '皮肤性病科'], [16, '护理科'], [17, '临床其他'], [18, '检验科'], [19, '病理科'], [20, '影像科'], 
                [21, '功能检查科'], [22, '药剂科'], [23, '行政辅助'], [24, '科研中心'], [25, '心血管内科'], [26, '消化内科'], [27, '内分泌科'], [28, '免疫科'], [29, '风湿科'], [30, '呼吸科'], 
                [31, '肾脏外科'], [32, '血液科'], [33, '传染科'], [34, '感染科'], [35, '肝病科'], [36, '结核病科'], [37, '艾滋病科'], [38, '过敏反应科'], [39, '老年病科'], [40, '普通内科'], 
                [41, '全科'], [42, '特色医疗科'], [43, '干部诊疗科'], [44, '脊柱外科'], [45, '关节骨科'], [46, '手外科'], [47, '骨肿瘤科'], [48, '运动医学科'], [49, '骨代谢科'], [50, '泌尿外科'], 
                [51, '整形科'], [52, '烧伤科'], [53, '器官移植'], [54, '微创外科'], [55, '腔镜外科'], [56, '手术室'], [57, '外伤科'], [58, '妇科'], [59, '妇科内分泌'], [60, '妇泌尿科'], 
                [61, '肿瘤妇科'], [62, '产科'], [63, '产房'], [64, '普通产科'], [65, '高危产科'], [66, '产前检查科'], [67, '遗传科'], [68, '计划生育科'], [69, '生殖中心'], [70, '小儿内科'], 
                [71, '小儿呼吸科'], [72, '小儿消化科'], [73, '小儿神经内科'], [74, '小儿心内科'], [75, '小儿肾内科'], [76, '小儿内分泌科'], [77, '小儿免疫科'], [78, '小儿血液科'], [79, '小儿感染科'], [80, '小儿精神科'], 
                [81, '小儿外科'], [82, '小儿心外科'], [83, '小儿胸外科'], [84, '小儿骨科'], [85, '小儿泌尿科'], [86, '小儿神经外科'], [87, '小儿整形科'], [88, '新生儿科'], [89, '小儿皮肤科'], [90, '小儿耳鼻喉'], 
                [91, '小儿妇科'], [92, '小儿急诊科'], [93, '儿童保健科'], [94, '儿童康复科'], [95, '神经科'], [96, '精神科'], [97, '心理科'], [98, '司法鉴定科'], [99, '中医内科'], [100, '中医内分泌'], 
                [101, '中医消化科'], [102, '中医呼吸科'], [103, '中医肾脏内科'], [104, '中医免疫内科'], [105, '中医心内科'], [106, '中医神经内科'], [107, '中医精神科'], [108, '中医肿瘤科'], [109, '中医血液科'], [110, '中医感染内科'], 
                [111, '中医肝病科'], [112, '中医男科'], [113, '中医老年病科'], [114, '中医外科'], [115, '中医骨伤科'], [116, '中医乳腺外科'], [117, '中医肛肠科'], [118, '中医妇产科'], [119, '中医儿科'], [120, '中医皮肤科'], 
                [121, '中医五官科'], [122, '中医按摩科'], [123, '针灸科'], [124, '推拿科'], [125, '中西医结合科'], [126, '肿瘤内科'], [127, '肿瘤外科'], [128, '肿瘤妇科'], [129, '放疗科'], [130, '骨肿瘤科'], 
                [131, '肿瘤康复科'], [132, '肿瘤综合科'], [133, '眼底'], [134, '角膜科'], [135, '青光眼'], [136, '白内障'], [137, '眼外伤'], [138, '眼眶及肿瘤'], [139, '眼视光学'], [140, '眼整形'], 
                [141, '中医眼科'], [142, '小儿眼科'], [143, '颌面外科'], [144, '正畸科'], [145, '牙体牙髓科'], [146, '牙周科'], [147, '口腔粘膜科'], [148, '儿童口腔科'], [149, '口腔修复科'], [150, '种植科'], 
                [151, '口腔预防科'], [152, '口腔特诊科'], [153, '口腔急诊科'], [154, '头颈外科'], [155, '急诊科'], [156, '重症医学科'], [157, '疼痛科'], [158, '皮肤科'], [159, '性病科'], [160, '皮肤美容'], 
                [161, '激光室'], [162, '男科'], [163, '基础护理'], [164, '内科护理'], [165, '外科护理'], [166, '妇产科护理'], [167, '儿科护理'], [168, 'ICU护理'], [169, '手术室护理'], [170, '五官科护理'], 
                [171, '肿瘤护理'], [172, '门诊部'], [173, '介入医学科'], [174, '康复科'], [175, '理疗科'], [176, '预防保健科'], [177, '高压氧科'], [178, '体检科'], [179, '运动医学科'], [180, '职业病科'], 
                [181, '地方病科'], [182, '营养科'], [183, '特诊科'], [184, '输血科'], [185, '血液检验'], [186, '体液检验'], [187, '生化室'], [188, '免疫室'], [189, '临床检验室'], [190, '临床微生物室'], 
                [191, 'PCR实验室'], [192, '输血科'], [193, '消毒供应室'], [194, '血气室'], [195, '细胞室'], [196, '微量元素室'], [197, '急诊化验室'], [198, '病理科'], [199, '核医学科'], [200, '放射科'], 
                [201, 'X线室'], [202, 'CT室'], [203, 'spect室'], [204, 'MRI室'], [205, '超声科'], [206, 'B超科'], [207, '彩超科'], [208, '心超科'], [209, '细胞室'], [210, '微量元素室'],
                [211, '急诊化验室'], [212, '心电图室'], [213, '脑电图室'], [214, '肌电图室'], [215, '肺功能室'], [216, '骨密度室'], [217, '内镜科'], [218, '血透中心'], [219, '碎石中心'], [220, '中药房'], 
                [221, '西药房'], [222, '调剂科'], [223, '制剂室'], [224, '质检科'], [225, '药剂实验室'], [226, '药理实验室'], [227, '科教处'], [228, '医务科'], [229, '病案科'], [230, '院感科'],
                [231, '信息科'], [232, '院办'], [233, '宣传科'], [234, '研究生处'], [235, '党办'], [236, '人事科'], [237, '医保科'], [238, '护理部'], [239, '质控科'], [240, '后勤科'], 
                [241, '设备科'], [242, '实验中心'], [243, '分子生物学实验室'], [244, '细胞培养实验室'], [245, '免疫组化实验室'], [246, '质谱分析室'], [247, '动物房'], [248, '血液研究所'], [249, '肿瘤研究所'], [250, '临床医学研究所'], 
                [251, '老年病研究所'], [252, '神经研究所'], [253, '心血管病研究所'], [254, '精神卫生研究所'], [255, '职业病研究所'], [256, '中医药研究院'], [257, '科室'], [258, '一级科室'], [259, '二级科室']
                ];

                wa();
            });
            
        }],
        template: template,
        compile: function (element, attrs, transclude) {
            function format(state) {
                var state_id = state.id;
                if (!state_id) return state.text; // optgroup
                return state.text;
            }
            function makeOptionsData(datas) {
                var data = { results: [] };
                var options = datas;
                for (var i = 0; options && i < options.length; i++) {
                    data.results.push({ id: options[i][0], text: options[i][1] });
                }
                return data;
            }
            function renderSelector(elem, options, value) {
                $(elem).select2("destroy");
                var settings = {
                    formatResult: format,
                    formatSelection: format,
                    minimumResultsForSearch: true,
                    dropdownCssClass: 'form-white',
                    allowClear: true,
                };
                if ($(elem).is('select')) {
                } else {
                    settings.data = options;
                }
                $(elem).select2(settings);
                value && $(elem).select2("val", value);
            }


            return function (scope, element, attrs) {
                var tmpl = template;
                element.html(tmpl);//.show();
                $compile(element.contents())(scope);

                scope.$watch('specialists', function (newValue, oldValue) {
                    $timeout(function () {
                        var data = makeOptionsData(newValue);
                        renderSelector($(element), data, scope.specialties);
                    }, 800);
                });

            };
        },
        link: function (scope, element, attrs, ctrl) {
        }
    };
}]);